Revit 2027 API
Wall.RemoveAttachment(ElementId) Method
 Removes any attachment of the wall to the specified target.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemoveAttachment(
	ElementId targetId
)
Public Sub RemoveAttachment (
	targetId As ElementId
)
public:
void RemoveAttachment(
	ElementId^ targetId
)
member RemoveAttachment :
        targetId : ElementId -> unit
Parameters
targetId ElementId
 Target element id.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
Wall Class
RemoveAttachment Overload
Autodesk.Revit.DB Namespace